[
    {
        "name": "Jalen Johnson",
        "status": "Day-To-Day",
        "comment": "Mar 19: Johnson implied after exiting in the fourth quarter of Monday's 136-105 loss to the Lakers with a right ankle injury that he's feeling OK, though his status for Thursday's game in Phoenix is cloudy, Lauren L. Williams of The Atlanta Journal-Constitution reports."
    },
    {
        "name": "Seth Lundy",
        "status": "Out",
        "comment": "Mar 18: Lundy (back) was inactive Sunday in the G League College Park Skyhawks' 96-91 loss to the Sioux Falls Skyforce due to a back injury."
    },
    {
        "name": "AJ Griffin",
        "status": "Out",
        "comment": "Mar 18: Griffin (lower body) has been ruled out for Monday's game against the Lakers."
    },
    {
        "name": "Mouhamed Gueye",
        "status": "Out",
        "comment": "Mar 15: Gueye suffered a UCL sprain in his right elbow during Tuesday's G League game against the Indiana Mad Ants and will be re-evaluated in 7-10 days. The Hawks also recalled Gueye from the College Park Sky Hawks on Friday."
    },
    {
        "name": "Saddiq Bey",
        "status": "Out",
        "comment": "Mar 11: Bey suffered a torn left ACL and is out for the remainder of the season, ESPN's Adrian Wojnarowski reports."
    },
    {
        "name": "Kobe Bufkin",
        "status": "Out",
        "comment": "Mar 7: The Hawks announced Thursday that Bufkin (toe) has been diagnosed with a left big toe sprain and will be in a walking boot for the next 10 days, Brad Rowland of the Locked On Podcast Network reports."
    },
    {
        "name": "Trae Young",
        "status": "Out",
        "comment": "Feb 25: Young (finger) has a torn radial collateral ligament in the fifth finger of his left hand. He will undergo surgery Tuesday and be re-evaluated in four weeks."
    },
    {
        "name": "Jrue Holiday",
        "status": "Out",
        "comment": "Mar 20: Holiday (shoulder) won't play Wednesday against the Bucks, Justin Turpin of WEEI.com reports."
    },
    {
        "name": "Sam Hauser",
        "status": "Out",
        "comment": "Mar 20: Hauser (ankle) won't play in Wednesday's game versus the Bucks, Justin Turpin of WEEI.com reports."
    },
    {
        "name": "Dorian Finney-Smith",
        "status": "Out",
        "comment": "Mar 20: Finney-Smith (ankle) is out for Thursday's game versus the Bucks, C.J. Holmes of the New York Daily News reports."
    },
    {
        "name": "Nic Claxton",
        "status": "Day-To-Day",
        "comment": "Mar 20: Claxton is questionable for Thursday's game against Milwaukee due to an illness, Brian Lewis of the New York Post reports."
    },
    {
        "name": "Ben Simmons",
        "status": "Out",
        "comment": "Mar 14: Simmons underwent a successful microscopic partial discectomy Thursday and is expected to make a full recovery for training camp next season, Michael Scotto of USA Today reports."
    },
    {
        "name": "Dariq Whitehead",
        "status": "Out",
        "comment": "Jan 29: Whitehead underwent successful season-ending surgery on his left shin stress reaction Monday and is expected to need three months to recover, Evan Barnes of Newsday reports."
    },
    {
        "name": "Coby White",
        "status": "Out",
        "comment": "Mar 20: White (hip) is listed as questionable for Thursday's game versus the Rockets."
    },
    {
        "name": "Alex Caruso",
        "status": "Day-To-Day",
        "comment": "Mar 20: Caruso (ankle) is questionable for Thursday's game in Houston."
    },
    {
        "name": "Julian Phillips",
        "status": "Out",
        "comment": "Mar 15: The Bulls announced Friday that Phillips has been diagnosed with a right foot sprain and is out indefinitely."
    },
    {
        "name": "Lonzo Ball",
        "status": "Out",
        "comment": "Mar 9: Ball (knee) has begun cutting, sprinting and jumping in controlled, non-contact situations, K.C. Johnson of NBC Sports Chicago reports."
    },
    {
        "name": "Patrick Williams",
        "status": "Out",
        "comment": "Feb 23: The Bulls announced Friday that Williams will undergo surgery to address bone edema in his left foot and will be out for the remainder of 2023-24."
    },
    {
        "name": "Zach LaVine",
        "status": "Out",
        "comment": "Feb 8: LaVine underwent season-ending surgery on his right foot Thursday, Will Gottlieb of AllCHGO.com reports."
    },
    {
        "name": "Dean Wade",
        "status": "Out",
        "comment": "Mar 19: Wade (knee) has been ruled out for Wednesday's game against the Heat."
    },
    {
        "name": "Max Strus",
        "status": "Out",
        "comment": "Mar 19: Strus (knee) has been ruled out for Wednesday's game against the Heat."
    },
    {
        "name": "Donovan Mitchell",
        "status": "Out",
        "comment": "Mar 19: Mitchell will be re-evaluated in one week after undergoing a procedure on his nasal fracture Tuesday, Shams Charania of The Athletic reports."
    },
    {
        "name": "Evan Mobley",
        "status": "Out",
        "comment": "Mar 11: Mobley (ankle) is no longer wearing a walking boot, Chris Fedor of The Cleveland Plain Dealer reports."
    },
    {
        "name": "Ty Jerome",
        "status": "Out",
        "comment": "Jan 25: Jerome underwent arthroscopic surgery on his right ankle on January 23 and he remains out indefinitely, Spencer Davies of SI.com reports."
    },
    {
        "name": "Josh Green",
        "status": "Out",
        "comment": "Mar 17: Coach Jason Kidd said Sunday that Green is \"likely out a couple of weeks\" after suffering a right ankle sprain in Thursday's loss to Oklahoma City, Mavericks radio play-by-play broadcaster Chuck Cooperstein reports."
    },
    {
        "name": "Brandon Williams",
        "status": "Out",
        "comment": "Mar 16: Wiliams (wrist) won't play in Sunday's game versus the Thunder."
    },
    {
        "name": "Zeke Nnaji",
        "status": "Day-To-Day",
        "comment": "Mar 20: Nnaji (back) is out for Tuesday's game versus the Timberwolves, Vinny Benedetto of The Denver Gazette reports."
    },
    {
        "name": "Vlatko Cancar",
        "status": "Out",
        "comment": "Aug 17: Cancar underwent surgery surgery on his left knee Thursday and is out indefinitely, Vinny Benedetto of The Denver Gazette reports."
    },
    {
        "name": "Taj Gibson",
        "status": "Out",
        "comment": "Mar 20: Gibson (hamstring) has been ruled out for Wednesday's game against the Pacers, James L. Edwards III of The Athletic reports."
    },
    {
        "name": "Simone Fontecchio",
        "status": "Out",
        "comment": "Mar 20: Fontecchio (toe) has been ruled out for Wednesday's game against the Pacers, Omari Sankofa II of the Detroit Free Press"
    },
    {
        "name": "Isaiah Stewart",
        "status": "Out",
        "comment": "Mar 20: Stewart (hamstring) has been ruled out for the remainder of the 2023-24 season, Keith Langlois of the Pistons' official site reports."
    },
    {
        "name": "Ausar Thompson",
        "status": "Out",
        "comment": "Mar 20: The Pistons announced Wednesday that Thompson will miss the remainder of the season while being treated for a blood clot, Shams Charania of The Athletic reports."
    },
    {
        "name": "Quentin Grimes",
        "status": "Out",
        "comment": "Mar 19: Grimes (knee) won't play in Wednesday's game versus the Pacers."
    },
    {
        "name": "Moses Moody",
        "status": "Day-To-Day",
        "comment": "Mar 19: Moody (knee) is questionable for Wednesday's game against Memphis."
    },
    {
        "name": "Draymond Green",
        "status": "Day-To-Day",
        "comment": "Mar 19: Green (back) is questionable for Wednesday's game against the Grizzlies."
    },
    {
        "name": "Cam Whitmore",
        "status": "Out",
        "comment": "Mar 12: Coach Ime Udoka said Tuesday that Whitmore (knee) will miss roughly three weeks, Jonathan Feigen of the Houston Chronicle reports."
    },
    {
        "name": "Alperen Sengun",
        "status": "Out",
        "comment": "Mar 12: Shams Charania of The Athletic reported Tuesday that Sengun (ankle) has been diagnosed with a Grade 3 right ankle sprain and will likely miss the remainder of the regular season."
    },
    {
        "name": "Tari Eason",
        "status": "Out",
        "comment": "Mar 5: The Rockets announced Tuesday that Eason underwent successful surgery to treat a benign growth in his lower leg, and he's expected to make a full recovery in approximately four months."
    },
    {
        "name": "Steven Adams",
        "status": "Out",
        "comment": "Feb 1: Adams (knee) was traded from the Grizzlies to the Rockets in exchange for Victor Oladipo and three second-round picks Thursday, Adrian Wojnarowski of ESPN reports."
    },
    {
        "name": "Bennedict Mathurin",
        "status": "Out",
        "comment": "Mar 9: Mathurin is slated to undergo season-ending surgery to repair a torn labrum in his right shoulder, Adrian Wojnarowski of ESPN reports."
    },
    {
        "name": "Terance Mann",
        "status": "Day-To-Day",
        "comment": "Mar 20: Mann (shoulder) participated in shootaround ahead of Wednesday's game versus the Trail Blazers, Law Murray of The Athletic reports."
    },
    {
        "name": "Norman Powell",
        "status": "Day-To-Day",
        "comment": "Mar 20: Powell (lower leg) participated in shootaround ahead of Wednesday's game versus the Trail Blazers, Law Murray of The Athletic reports."
    },
    {
        "name": "Moussa Diabate",
        "status": "Day-To-Day",
        "comment": "Mar 17: Diabate recorded 10 points (4-14 FG, 1-1 FT), 18 rebounds, five assists, three steals and three blocks over 39 minutes in Sunday's 115-111 win over Westchester."
    },
    {
        "name": "Russell Westbrook",
        "status": "Out",
        "comment": "Mar 4: Westbrook underwent surgery on his fractured left hand Monday, and the hope is that he will return before the start of the playoffs, Adrian Wojnarowski of ESPN reports."
    },
    {
        "name": "Cam Reddish",
        "status": "Out",
        "comment": "Mar 20: Coach Darvin Ham said Reddish (ankle) was a full participant during Wednesday's practice and expects him to be available Friday against the 76ers, Dave McMenamin of ESPN.com reports."
    },
    {
        "name": "Christian Wood",
        "status": "Out",
        "comment": "Mar 19: Wood (knee) underwent a successful arthroscopic procedure on his left knee Tuesday, Ryan Ward of LakersNation.com reports."
    },
    {
        "name": "Gabe Vincent",
        "status": "Out",
        "comment": "Mar 19: Vincent (knee) is nearing a return to action and intends to play again this season, barring a setback, NBA writer Marc Stein reports."
    },
    {
        "name": "Jarred Vanderbilt",
        "status": "Out",
        "comment": "Mar 12: Vanderbilt (foot) is progressing in his rehab, but he has not been cleared for on-court activities as of Tuesday, Khobi Price of The Orange County Register reports."
    },
    {
        "name": "Colin Castleton",
        "status": "Out",
        "comment": "Feb 25: Castleton is expected to miss multiple weeks after he recently suffered a fractured right wrist, Dan Woike of the Los Angeles Times reports."
    },
    {
        "name": "Lamar Stevens",
        "status": "Out",
        "comment": "Mar 19: Stevens (adductor) won't play in Wednesday's game versus the Warriors."
    },
    {
        "name": "Yuta Watanabe",
        "status": "Out",
        "comment": "Mar 19: Watanabe (personal) will not play against the Warriors on Wednesday."
    },
    {
        "name": "Brandon Clarke",
        "status": "Out",
        "comment": "Mar 19: Clarke (Achilles) won't play in Wednesday's game versus the Warriors."
    },
    {
        "name": "Scotty Pippen Jr.",
        "status": "Out",
        "comment": "Mar 19: Pippen (leg) will not play against the Warriors on Wednesday."
    },
    {
        "name": "Santi Aldama",
        "status": "Day-To-Day",
        "comment": "Mar 19: Aldama (elbow) is listed as questionable for Wednesday's game versus the Warriors."
    },
    {
        "name": "Luke Kennard",
        "status": "Out",
        "comment": "Mar 19: Kennard (personal) won't play in Wednesday's game versus the Warriors."
    },
    {
        "name": "Vince Williams Jr.",
        "status": "Out",
        "comment": "Mar 19: Williams (knee) is doubtful for Wednesday's game against the Warriors."
    },
    {
        "name": "Derrick Rose",
        "status": "Out",
        "comment": "Mar 5: Rose will be re-evaluated in three weeks after being diagnosed with a right osteitis pubis stemming from an injury suffered on Feb. 28 against Minnesota, Damichael Cole of The Memphis Commercial Appeal reports."
    },
    {
        "name": "Ziaire Williams",
        "status": "Out",
        "comment": "Mar 5: The Grizzlies announced Tuesday that Williams has been diagnosed with a Grade 2 strain of hip flexor and low back muscles and will be re-evaluated in four weeks."
    },
    {
        "name": "Marcus Smart",
        "status": "Out",
        "comment": "Feb 22: The Grizzlies announced Thursday that Smart (finger) will be re-evaluated in three weeks."
    },
    {
        "name": "Ja Morant",
        "status": "Out",
        "comment": "Jan 11: Morant underwent successful surgery on his right shoulder Thursday and will be out for the remainder of 2023-24, Chris Haynes of Turner Sports reports."
    },
    {
        "name": "Bam Adebayo",
        "status": "Out",
        "comment": "Mar 20: Adebayo (back) has been ruled out for Wednesday's game against Cleveland, Ira Winderman of the South Florida Sun Sentinel reports."
    },
    {
        "name": "Kevin Love",
        "status": "Out",
        "comment": "Mar 19: Love (heel) has been ruled out for Wednesday's game against the Cavaliers, Ira Winderman of the South Florida Sun Sentinel reports."
    },
    {
        "name": "Duncan Robinson",
        "status": "Out",
        "comment": "Mar 19: Robinson (back) will be unavailable for Wednesday's game against Cleveland."
    },
    {
        "name": "Tyler Herro",
        "status": "Out",
        "comment": "Mar 16: Herro (foot) received a platelet-rich plasma injection Friday on his right foot and will re-evaluated in 1-2 weeks, Anthony Chiang of the Miami Herald reports."
    },
    {
        "name": "Josh Richardson",
        "status": "Out",
        "comment": "Mar 6: The Heat announced that Richardson underwent successful surgery to repair right shoulder instability Wednesday."
    },
    {
        "name": "Giannis Antetokounmpo",
        "status": "Out",
        "comment": "Mar 20: Antetokounmpo (hamstring) will not play in Wednesday's game against the Celtics, Shams Charania of The Athletic reports."
    },
    {
        "name": "Naz Reid",
        "status": "Day-To-Day",
        "comment": "Mar 20: Reid (head) is inactive for Tuesday's game against Denver, Tim MacMahon of ESPN.com reports."
    },
    {
        "name": "Rudy Gobert",
        "status": "Out",
        "comment": "Mar 19: Gobert (ribs) won't play in Tuesday's game versus the Nuggets."
    },
    {
        "name": "Jaylen Clark",
        "status": "Out",
        "comment": "Mar 19: Clark (Achilles) has been ruled out for Tuesday's game against the Nuggets and remains sidelined indefinitely."
    },
    {
        "name": "Karl-Anthony Towns",
        "status": "Out",
        "comment": "Mar 12: The Timberwolves announced Tuesday that Towns underwent successful surgery to repair a left knee lateral meniscus tear and will be re-evaluated in four weeks."
    },
    {
        "name": "Matt Ryan",
        "status": "Day-To-Day",
        "comment": "Mar 20: Ryan is listed as questionable for Thursday's game versus the Magic due to a non-COVID illness."
    },
    {
        "name": "Dyson Daniels",
        "status": "Out",
        "comment": "Mar 18: Daniels (knee) was able to go through a full practice Monday, Will Guillory of The Athletic reports."
    },
    {
        "name": "Mitchell Robinson",
        "status": "Out",
        "comment": "Mar 20: Robinson (ankle) was a full participant at Wednesday's practice, Steve Popper of Newsday reports."
    },
    {
        "name": "OG Anunoby",
        "status": "Day-To-Day",
        "comment": "Mar 19: Anunoby (elbow) is expected to miss time beyond Monday's game against Golden State, Adrian Wojnarowski of ESPN reports."
    },
    {
        "name": "Julius Randle",
        "status": "Out",
        "comment": "Mar 12: Randle (shoulder) continues ramping up in \"controlled contact situations\" but has not progressed to any scrimmaging, Tim Bontemps of ESPN.com reports."
    },
    {
        "name": "Joel Embiid",
        "status": "Out",
        "comment": "Mar 20: Embiid (knee) won't be with the 76ers during their upcoming four-game road trip, which starts Wednesday in Phoenix and ends Monday in Sacramento, Shams Charania of The Athletic reports."
    },
    {
        "name": "Tobias Harris",
        "status": "Day-To-Day",
        "comment": "Mar 20: Harris (ankle), who is questionable for Wednesday's game against the Suns, participated in Philadelphia's morning shootaround, Gina Mizell of The Philadelphia Inquirer reports."
    },
    {
        "name": "Kai Jones",
        "status": "Out",
        "comment": "Mar 19: Jones (hamstring) will be inactive for Wednesday's game against Phoenix."
    },
    {
        "name": "De'Anthony Melton",
        "status": "Out",
        "comment": "Mar 18: Head coach Nick Nurse said Monday that he had no update on the status of Melton, who hasn't played since Feb. 27 due to lumbar spine bone stress, Derek Bodner of AllPHLY.com reports."
    },
    {
        "name": "Robert Covington",
        "status": "Out",
        "comment": "Mar 17: Covington (knee) did some on-court work following Sunday's practice and is ramping up for a return to game action, Gina Mizell of The Philadelphia Inquirer reports."
    },
    {
        "name": "Damion Lee",
        "status": "Out",
        "comment": "Mar 20: Lee (knee) has been ruled out for Wednesday's game against the 76ers, and there's no timetable for his return."
    },
    {
        "name": "Josh Okogie",
        "status": "Out",
        "comment": "Mar 19: Okogie (abdomen) will not play Wednesday against the 76ers, Kellan Olson of ArizonaSports.com reports."
    },
    {
        "name": "Bol Bol",
        "status": "Day-To-Day",
        "comment": "Mar 19: Bol is probable for Wednesday's game versus the 76ers with a right ankle sprain, Kellan Olson of ArizonaSports.com reports."
    },
    {
        "name": "Anfernee Simons",
        "status": "Day-To-Day",
        "comment": "Mar 20: Simons is questionable for Wednesday's game against the Clippers due to left knee tendinitis."
    },
    {
        "name": "Matisse Thybulle",
        "status": "Day-To-Day",
        "comment": "Mar 19: Thybulle (ankle) is questionable for Wednesday's game against the Clippers."
    },
    {
        "name": "Malcolm Brogdon",
        "status": "Out",
        "comment": "Mar 19: Brogdon (elbow) is out for Wednesday's game versus the Clippers."
    },
    {
        "name": "Jerami Grant",
        "status": "Out",
        "comment": "Mar 19: Grant (hamstring) is doubtful for Wednesday's game against the Clippers."
    },
    {
        "name": "Shaedon Sharpe",
        "status": "Out",
        "comment": "Mar 7: Portland head coach Chauncey Billups said Wednesday that Sharpe (abdomen) has resumed light shooting work, Sean Highkin of RoseGardenReport.com reports."
    },
    {
        "name": "Robert Williams III",
        "status": "Out",
        "comment": "Nov 13: Williams underwent successful surgery Monday to reconstruct a torn ligament in his right knee after he sustained a patellar dislocation and is expected to make a full recovery ahead of the 2024-25 campaign."
    },
    {
        "name": "Sasha Vezenkov",
        "status": "Out",
        "comment": "Mar 20: Vezenkov (ankle) won't play in Wednesday's game versus the Raptors, Sean Cunningham of Fox 40 Sacramento reports."
    },
    {
        "name": "Kevin Huerter",
        "status": "Out",
        "comment": "Mar 19: Huerter (shoulder) will be inactive Wednesday against Toronto."
    },
    {
        "name": "Trey Lyles",
        "status": "Out",
        "comment": "Mar 15: Lyeles (knee) is expected to be reevaluated in two weeks due to an MCL sprain, Frankie Cartoscelli of KHTK Sactown Sports 1140 reports."
    },
    {
        "name": "Zach Collins",
        "status": "Day-To-Day",
        "comment": "Mar 20: Collins is out for Tuesday's game against them Mavericks due to concussion-like symptoms."
    },
    {
        "name": "Charles Bassey",
        "status": "Out",
        "comment": "Dec 12: Bassey will miss the remainder of the season after tearing his left ACL in Sunday's G League contest against the Legends, Jeff McDonald of the San Antonio Express-News reports."
    },
    {
        "name": "Immanuel Quickley",
        "status": "Out",
        "comment": "Mar 20: Quickley (personal) does not have a timetable to return, Eric Koreen of The Athletic reports."
    },
    {
        "name": "D.J. Carton",
        "status": "Out",
        "comment": "Mar 19: Carton (ankle) won't play in Wednesday's game versus the Kings, Blake Murphy of Sportsnet.ca reports."
    },
    {
        "name": "RJ Barrett",
        "status": "Out",
        "comment": "Mar 15: Coach Darko Rajakovic said Barrett, who remains away from the team while mourning the death of his younger brother, doesn't have a return timetable, Eric Koreen of The Athletic reports."
    },
    {
        "name": "Chris Boucher",
        "status": "Out",
        "comment": "Mar 11: Boucher has suffered a partial MCL tear in his right knee and will undergo further testing in coming days, Kayla Grey of TSN reports."
    },
    {
        "name": "Jakob Poeltl",
        "status": "Out",
        "comment": "Mar 5: The Raptors announced Tuesday that Poeltl underwent surgery to repair a torn ligament in the pinkie of his left hand and is out indefinitely, Josh Lewenberg of TSN.ca reports."
    },
    {
        "name": "Scottie Barnes",
        "status": "Out",
        "comment": "Mar 4: Barnes underwent surgery to repair a fracture to the third metacarpal bone on his left hand Monday, Eric Smith of Sportsnet 590 The Fan reports."
    },
    {
        "name": "Jordan Clarkson",
        "status": "Out",
        "comment": "Mar 19: Clarkson (groin) will not play in Wednesday's game against Oklahoma City, Andy Larsen of The Salt Lake Tribune reports."
    },
    {
        "name": "Lauri Markkanen",
        "status": "Out",
        "comment": "Mar 19: Markkanen is out for Wednesday's game versus the Thunder due to quadriceps contusion maintenance, Andy Larsen of The Salt Lake Tribune reports."
    },
    {
        "name": "Eugene Omoruyi",
        "status": "Out",
        "comment": "Mar 20: Omoruyi (ankle) has been ruled out for Thursday's game against the Kings."
    },
    {
        "name": "Marvin Bagley III",
        "status": "Out",
        "comment": "Mar 20: Bagley (back) won't play in Thursday's game versus the Kings."
    },
    {
        "name": "Landry Shamet",
        "status": "Out",
        "comment": "Mar 20: Shamet (calf) has been ruled out for Thursday's game against the Kings."
    },
    {
        "name": "Richaun Holmes",
        "status": "Day-To-Day",
        "comment": "Mar 20: Holmes is questionable for Thursday's game against the Kings due to a non-COVID illness."
    },
    {
        "name": "Tyus Jones",
        "status": "Out",
        "comment": "Mar 20: Jones (back) has been ruled out for Thursday's game against the Kings."
    },
    {
        "name": "Deni Avdija",
        "status": "Out",
        "comment": "Mar 20: Avdija (knee) is questionable for Thursday's game versus the Kings."
    },
    {
        "name": "Bilal Coulibaly",
        "status": "Out",
        "comment": "Mar 18: Coulibaly will miss the remainder of the season due to an ongoing recovery from a right wrist contusion, Ava Wallace of The Washington Post reports."
    },
    {
        "name": "Isaiah Livers",
        "status": "Out",
        "comment": "Feb 26: Livers (hip) has been ruled out for the remainder of the regular season."
    }
]